Tekla.Structures.Model.Connection
The Connection class represents a connection. A connection is something that connects two or more parts together.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using Tekla.Structures;
using System;
public class Example
{
public void Example1()
{
Beam B1 = new Beam(new Point(15000,0,-500), new Point(15000,0,6000));
B1.Profile.ProfileString = "HEA400";
B1.Material.MaterialString = "S235JR";
Beam B2 = new Beam(new Point(15000,0,0), new Point(18000,0,0));
B2.Profile.ProfileString = "HEA400";
B2.Material.MaterialString = "S235JR";
B1.Insert();
B2.Insert();
Connection C = new Connection();
C.Name = "Test End Plate";
C.Number = 144;
C.LoadAttributesFromFile("standard");
C.UpVector = new Vector(0,0,1000);
C.PositionType = PositionTypeEnum.COLLISION_PLANE;
// Use this value to have the same orientation as defined in the attribute file
C.AutoDirectionType = AutoDirectionTypeEnum.AUTODIR_FROM_ATTRIBUTE_FILE;
C.SetPrimaryObject(B1);
C.SetSecondaryObject(B2);
C.SetAttribute("e2", 10.0);
C.SetAttribute("e1", 10.0);
if(!C.Insert())
{
Console.WriteLine("Connection Insert failed");
}
else
{
Console.WriteLine(C.Identifier.ID);
Double DValue = 0.0;
if(!C.GetAttribute("e2", ref DValue) || DValue != 10)
Console.WriteLine("Connection GetAttribute failed");
}
}
}

Tekla.Structures.Model.Connection.Class
The class of the connection.

Tekla.Structures.Model.Connection.UpVector
A vector indicating which direction is considered the up direction for the connection.

Tekla.Structures.Model.Connection.AutoDirectionType
The auto direction type. Default value is AUTODIR_BASIC.
Value should be AUTODIR_NA to set direction with UpVector property.
Value should be AUTODIR_FROM_ATTRIBUTE_FILE to set direction with connection attribute file.

Tekla.Structures.Model.Connection.PositionType
The position type.
When creating custom connections this attribute is not applied,
instead the position type used when creating the custom connection
is used.

Tekla.Structures.Model.Connection.Code
The code of the connection. The code can be used to classify the connection.
The code of the connection can be reported and shown in drawings.
The maximum length of the string is 20 characters.

Tekla.Structures.Model.Connection.Status
The read only status of the connection.
The status can be reported and shown in drawings.
The color of the connection symbol in the model indicates the status of the connection.

Tekla.Structures.Model.Connection.#ctor
Creates a new connection instance.

Tekla.Structures.Model.Connection.SetPrimaryObject(Tekla.Structures.Model.ModelObject)
Sets the primary object of the connection.
M: The primary object.
Returns: True on success.

Tekla.Structures.Model.Connection.GetPrimaryObject
Returns the primary object of the connection.
Returns: The primary object.

Tekla.Structures.Model.Connection.SetSecondaryObject(Tekla.Structures.Model.ModelObject)
Sets the secondary object of the connection. Use this
method if you wish to add only one secondary object
to the connection.
M: The secondary object.
Returns: True on success.

Tekla.Structures.Model.Connection.SetSecondaryObjects(System.Collections.ArrayList)
Sets an array list of model objects as the secondary objects of the connection.
Secondaries: An array list containing the secondary objects.
Returns: True on success.

Tekla.Structures.Model.Connection.GetSecondaryObjects
Returns the secondary objects.
Returns: An array list containing all the secondary objects.

Tekla.Structures.Model.Connection.Insert
Inserts the connection into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.Connection.Select
Selects a connection from the model database. The connection ID must be set.
Returns: True on success.

Tekla.Structures.Model.Connection.Modify
Modifies the existing connection in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.Connection.Delete
Deletes the connection instance with the given ID from the model database.
Returns: True on success.